#include <stdio.h>
#include <stdlib.h>

/* run this program using the console pauser or add your own getch, system("pause") or input loop */
/*
153 = 1*100 + 5*10 + 3*1
1001 = 1*8 + 0*4 + 0*2 + 1*1 = 9
0 0000
1 0001
2 0010
3 0011
4 0100
5 0101
6 0110
7 0111
8 1000
9 1001
10 a 1010
11 b 1011
12 c 1100
13 d 1101
14 e 1110
15 f 1111
*/
int main(int argc, char *argv[]) {
	
	int a = 0xb3; // 2진수 10110011 -> 16진수  0xb3 
	int b = 0xb3;
	int i;
	// 2번비트를 1로 만들기 
	//a = a| 0x04; // 0x04 2번 비트가 1인값
	//a |= 0x04;
	a |= 1<<2;
	printf("%d %x\n", a, a);
	
	// 2번과 3번 비트를 1로 만들기
	b |= 1<<2 | 1<<3;
	printf("%d %x\n", b, b); 
	
	// 1번비트를 0으로 만들기
	//     11110011
	//  &  11111101  1번비트가 0인값과 AND연산 
	//  ------------
	//     11110001
	//
	// 0&0->0  0&1->0 1&0->0 1&1->1
	//
	a = 0xf3;
	a &= ~(1<<1);  // ~(00000010) -> 11111101
	
	// 2번 3번 비트를 0으로
	a &= ~(1<<2|1<<3);
	
	// XOR ^
	// 0^0 -> 0  0^1 -> 1  1^0 -> 1  1^1 -> 0
	// 특정 비트를 반전(toggle)시키는 연산 
	printf("XOR\n", a);
	a = 0x00;
	printf("%d\n", a);
	a ^= 1<<3;
	printf("%d\n", a);
	a ^= 1<<3;
	printf("%d\n", a);
	
	// 두 숫자가 같은가?
	// 같은값으로 XOR -> 0 => 거짓 
	// 서로 다른값 XOR -> 0이 아닌값 => 참
	// if(a!=b) // a, b가 다르면.. 
	// if(a^b) // a, b가 다르면.. 
	a = 0x4a;
	//b = 0x4a;
	b = 0x3a;
	printf("a^b -> %d\n", a^b); 
	
	// 비트 검사
	// b3번이 0인경우==0(거짓), b3이 1인경우 !=0 (참) 
	// 참, 거짓을 활용해 해당 비트가 0인지 1인지 판단 
	//    0100   1100
	//  & 1000   1000
	// -------  ------
	//    0000   1000
	
	a = 0x0c;  // 00001100
	// a = 0x04;
	if(a&1<<3) // a의 3번 비트를 검사.. 
		printf("b3 : 1\n");
	else
		printf("b3 : 0\n");
		
	b = (a&1<<3)? 1:0;
	printf("%d\n", b);
	
	for(i=3;i>=0;i--)
	{
		b = (a&1<<i)? 1:0;
		printf("%d", b);
	}
	return 0;
}
